IdeaRS.OpenModel.Concrete.ImperfectionDirection
direction of imperfection

IdeaRS.OpenModel.Concrete.ImperfectionDirection.BothDirections
Imperfections are separately added to both directions, y and z.

IdeaRS.OpenModel.Concrete.ImperfectionDirection.BiggerSlenderner
bigger slenderness direction

IdeaRS.OpenModel.Concrete.ImperfectionDirection.MomentResultant
resultant of moments

IdeaRS.OpenModel.Concrete.ImperfectionDirection.Both
both

IdeaRS.OpenModel.Concrete.ImperfectionDirection.FromSetup
Takes imperfection direction from global code setup.
This value must not be used in code setup!